InformationRegisters/РазмерыВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РазмерыВычетовИПН</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПределаВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПределовВычетовИКорректировокДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидВычетаИПН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПредоставленияВычетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПредоставленияВычетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИсчисленнойСуммеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандартный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПериодическимПлатежам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РазмерыВычетовИПН/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если СтрокаНабора.Период < Дата('20190101') Тогда
			
			ВызватьИсключение НСтр("ru = 'Данные в регистр сведений о размере предела вычета ИПН вводятся не ранее 2019 года (до 2019 используется реквизит справочника ""Виды вычетов ИПН""'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидВычетаИПН.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
			
			ВызватьИсключение НСтр("ru = 'Невозможно ввести данные о размере вычета для периода предоставления ""По исчисленной сумме взносов""'");	
			
		КонецЕсли;
		
		Если СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетОПВ
			ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетВОСМС
			ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы Тогда
			
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Невозможно ввести данные о размере для вычетов ""%1"", ""%2"", ""%3"", ""%4""'"), 
																						Справочники.ВидыВычетовИПН.ВычетОПВ, 
																						Справочники.ВидыВычетовИПН.ВычетВОСМС, 
																						Справочники.ВидыВычетовИПН.ДобровольныеПенсионныеВзносы);
			
		КонецЕсли;
		
		Если СтрокаНабора.Период < Дата('20250101')
			И (СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляКаждогоРодителя
			 	ИЛИ СтрокаНабора.ВидВычетаИПН = Справочники.ВидыВычетовИПН.ВычетДляМногодетнойСемьиДляОдногоИзРодителей) Тогда
			
			ВызватьИсключение НСтр("ru = 'Данные о вычетах для многодетных семей вводятся с 2025 года'");	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
